In [8]:
# Create a program that asks the user to enter their name and their age. 
# Print out a message that tells them the year that they will turn 100 years old

name = str(input().strip())
age = int(input().strip())

import datetime

currentDateTime = datetime.datetime.now()
date = currentDateTime.date()
year = int(date.strftime("%Y"))

result = 100 - age +year

result

prad
34

2088

In [6]:
#What is pandas groupby? Demonstrate with your own example
import pandas as pd
df = pd.DataFrame({'Animal': ['tiger', 'tiger','fox', 'fox'],
                   'Max Speed': [380, 370, 120, 26]})

df.groupby(['Animal']).mean()

        Max Speed
Animal
fox            73
tiger         375

In [21]:
#How to create a dataframe from list

l1 = list(range(10))
df = pd.DataFrame(l1)
df

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7
8  8
9  9

In [29]:
#What are the ways to combine the dataframe in pandas. Give an example for each
#concat

dict1 = {
  'brand': ['ford','hyundai','tata','maruthi'],
  'model': ['mustang','i10','nexon','brezza'],
  'year': [1980,1995,2018,2012]
}
df1 = pd.DataFrame(dict1)
dict2 = {
   'brand': ['ford','hyundai','tata','maruthi'],
  'electric':[True, False,True,False],
    'colors': ["red", "white", "blue","black"]}

df2 = pd.DataFrame(dict2)

pd.concat([df1,df2])

     brand    model    year electric colors
0     ford  mustang  1980.0      NaN    NaN
1  hyundai      i10  1995.0      NaN    NaN
2     tata    nexon  2018.0      NaN    NaN
3  maruthi   brezza  2012.0      NaN    NaN
0     ford      NaN     NaN     True    red
1  hyundai      NaN     NaN    False  white
2     tata      NaN     NaN     True   blue
3  maruthi      NaN     NaN    False  black

In [30]:
pd.merge(df1,df2,on=['brand','brand'])

     brand    model  year  electric colors
0     ford  mustang  1980      True    red
1  hyundai      i10  1995     False  white
2     tata    nexon  2018      True   blue
3  maruthi   brezza  2012     False  black

In [35]:
#Find out the mean, median and standard deviation of this numpy array -> np.array([1,5,3,100,4,48])
import numpy as np
a1 = np.array([1,5,3,100,4,48])

df = pd.DataFrame(a1)
df.agg([np.mean,np.median,np.std])

                0
mean    26.833333
median   4.500000
std     40.086989

In [36]:
#How will you remove duplicate elements from a list?
l1 = [10,2,3,5,3,2,7,9,6,6]

mylist = list( dict.fromkeys(l1) )

mylist

[10, 2, 3, 5, 7, 9, 6]

In [2]:
#What is a map() function in Python? Give an example
#The map() function applies a given function to each item of an iterable (list, tuple etc.) and returns an iterator.

numb = [2,3,4,5,6]

def sq(n):
    return n*n

sq_numb = list(map(sq,numb))
sq_numb

[4, 9, 16, 25, 36]

In [9]:
#What is vstack() in numpy? Give an example
import numpy as np
a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

np.vstack((a,b))

array([[1, 2, 3],
       [4, 5, 6]])